Identifier: local.fleet.Caffeine
Input:
  NAME: Caffeine
ParentRecipe: com.github.kitzy.fleet.Caffeine
ParentRecipeTrustInfo:
  non_core_processors:
    com.github.kitzy.FleetImporter/FleetImporter:
      git_hash: f2da228b8917097d82e17aa4d52e36c4d51f5035
      path: ~/Library/AutoPkg/RecipeRepos/com.github.kitzy.fleet-autopkg-recipes/FleetImporter/FleetImporter.py
      sha256_hash: f6bc88d927384421cddc3830f9d3ee05212a8ae2a0d318154788b9231a9bf7db
  parent_recipes:
    com.github.homebysix.pkg.Caffeine:
      git_hash: 13fe4fea20b645bfd9264124c0b96bdc1b9f6687
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.homebysix-recipes/Caffeine/Caffeine.pkg.recipe
      sha256_hash: ac31ef8b28f1f586aec3b788ae4c74278d174c692e1e1063c9f5ebea9cc9fa48
    com.github.kitzy.fleet.Caffeine:
      git_hash: 898cd44c4df8e8dfe19b2e583ee37b7a0f0a2863
      path: ~/Library/AutoPkg/RecipeRepos/com.github.kitzy.fleet-autopkg-recipes/Caffeine/Caffeine.fleet.recipe.yaml
      sha256_hash: 7f6958ba20d60c90834cad510f94f7a430d88f9d1963979158eab989f5a5f1c1
    com.github.peetinc.download.Caffeine:
      git_hash: 422113e2c5b9eab704721efed3aee4a9b6882069
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.peetinc-recipes/Caffeine/Caffeine.download.recipe
      sha256_hash: 11685cd8cbf44b39731a8fdae48c266dd84d5b3fb8c00de43f5ed8d0007eadc7
