Identifier: local.fleet.Caffeine
Input:
  NAME: Caffeine
ParentRecipe: com.github.kitzy.fleet.Caffeine
ParentRecipeTrustInfo:
  non_core_processors:
    com.github.kitzy.FleetImporter/FleetImporter:
      git_hash: ff8923374d48df797d03d7ce7101f04aa9276143
      path: ~/Library/AutoPkg/RecipeRepos/com.github.kitzy.fleet-autopkg-recipes/FleetImporter/FleetImporter.py
      sha256_hash: f840dfc79b029b879639478565ddf53b40db147b5fdd56cd2afb048cbac1e2ac
  parent_recipes:
    com.github.homebysix.pkg.Caffeine:
      git_hash: 13fe4fea20b645bfd9264124c0b96bdc1b9f6687
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.homebysix-recipes/Caffeine/Caffeine.pkg.recipe
      sha256_hash: ac31ef8b28f1f586aec3b788ae4c74278d174c692e1e1063c9f5ebea9cc9fa48
    com.github.kitzy.fleet.Caffeine:
      git_hash: 898cd44c4df8e8dfe19b2e583ee37b7a0f0a2863
      path: ~/Library/AutoPkg/RecipeRepos/com.github.kitzy.fleet-autopkg-recipes/Caffeine/Caffeine.fleet.recipe.yaml
      sha256_hash: 7f6958ba20d60c90834cad510f94f7a430d88f9d1963979158eab989f5a5f1c1
    com.github.peetinc.download.Caffeine:
      git_hash: 422113e2c5b9eab704721efed3aee4a9b6882069
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.peetinc-recipes/Caffeine/Caffeine.download.recipe
      sha256_hash: 11685cd8cbf44b39731a8fdae48c266dd84d5b3fb8c00de43f5ed8d0007eadc7
