<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>local.fleet.GithubDesktop</string>
	<key>Input</key>
	<dict>
		<key>BUILD</key>
		<string>darwin</string>
		<key>BUNDLE_ID</key>
		<string>com.github.GitHub</string>
		<key>NAME</key>
		<string>GitHub Desktop</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.kitzy.fleet.GithubDesktop</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict>
			<key>FleetGitOpsUploader</key>
			<dict>
				<key>path</key>
				<string></string>
				<key>sha256_hash</key>
				<string>PROCESSOR FILEPATH NOT FOUND</string>
			</dict>
		</dict>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.homebysix.download.GitHubDesktop</key>
			<dict>
				<key>git_hash</key>
				<string>929f09a8dc248349e9ce35f7d519c253298317d1</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.homebysix-recipes/GitHub/GitHubDesktop.download.recipe</string>
				<key>sha256_hash</key>
				<string>ddd466175cff624508787263a470f89b7c2dcc517e1d5cc381f59ec06c846012</string>
			</dict>
			<key>com.github.homebysix.pkg.GitHubDesktop</key>
			<dict>
				<key>git_hash</key>
				<string>dab19d8c72d5b4d2bab35a25dfd43d2e4ab15173</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.homebysix-recipes/GitHub/GitHubDesktop.pkg.recipe</string>
				<key>sha256_hash</key>
				<string>8bfa208120d6372efa61b1043046f6a08ef896e0d4c07a0853cd3f532026c798</string>
			</dict>
			<key>com.github.kitzy.fleet.GithubDesktop</key>
			<dict>
				<key>git_hash</key>
				<string>933ab12388d1ec3d88d7b06b8a7a836861d9f294</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.kitzy.fleet-autopkg-recipes/GitHub/GithubDesktop.fleet.recipe.yaml</string>
				<key>sha256_hash</key>
				<string>e433db608824efd8ac6a03544b2cb07a0558fe0383adfe128716bd30effef98c</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
