Identifier: local.fleet.GithubDesktop
Input:
  BUILD: darwin
  BUNDLE_ID: com.github.GitHub
  NAME: Github Desktop
ParentRecipe: com.github.kitzy.fleet.GithubDesktop
ParentRecipeTrustInfo:
  non_core_processors:
    FleetGitOpsUploader:
      git_hash: ab86416072b423f9d9afb4f6bc158cc7944e3e03
      path: ~/Library/AutoPkg/RecipeRepos/com.github.kitzy.fleet-autopkg-recipes/FleetGitOpsUploader.py
      sha256_hash: 6f9777cfac29cd6638bce617a077a12cd9bbffe63ff29f023d5268ed41068eee
  parent_recipes:
    com.github.homebysix.download.GitHubDesktop:
      git_hash: 929f09a8dc248349e9ce35f7d519c253298317d1
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.homebysix-recipes/GitHub/GitHubDesktop.download.recipe
      sha256_hash: ddd466175cff624508787263a470f89b7c2dcc517e1d5cc381f59ec06c846012
    com.github.homebysix.pkg.GitHubDesktop:
      git_hash: dab19d8c72d5b4d2bab35a25dfd43d2e4ab15173
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.homebysix-recipes/GitHub/GitHubDesktop.pkg.recipe
      sha256_hash: 8bfa208120d6372efa61b1043046f6a08ef896e0d4c07a0853cd3f532026c798
    com.github.kitzy.fleet.GithubDesktop:
      git_hash: ab86416072b423f9d9afb4f6bc158cc7944e3e03
      path: ~/Library/AutoPkg/RecipeRepos/com.github.kitzy.fleet-autopkg-recipes/GithubDesktop.fleet.recipe.yaml
      sha256_hash: 5a600c2213a39cfe7a32e8dc09500120c5a41c9c16d0dcd29b73dd1ae94360ff
