Identifier: local.fleet.GithubDesktop
Input:
  BUILD: darwin
  BUNDLE_ID: com.github.GitHub
  NAME: GitHub Desktop
ParentRecipe: com.github.kitzy.fleet.GithubDesktop
ParentRecipeTrustInfo:
  non_core_processors:
    com.github.kitzy.FleetGitOpsUploader/FleetGitOpsUploader:
      git_hash: 6d050b31a1207a7543f9777dd7c1d84c746a011f
      path: ~/Library/AutoPkg/RecipeRepos/com.github.kitzy.fleet-autopkg-recipes/FleetGitOpsUploader/FleetGitOpsUploader.py
      sha256_hash: 99d8ee605b4f94ec583054d443c715ad46fc04f998497118e6001cdf391c987f
  parent_recipes:
    com.github.homebysix.download.GitHubDesktop:
      git_hash: 929f09a8dc248349e9ce35f7d519c253298317d1
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.homebysix-recipes/GitHub/GitHubDesktop.download.recipe
      sha256_hash: ddd466175cff624508787263a470f89b7c2dcc517e1d5cc381f59ec06c846012
    com.github.homebysix.pkg.GitHubDesktop:
      git_hash: dab19d8c72d5b4d2bab35a25dfd43d2e4ab15173
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.homebysix-recipes/GitHub/GitHubDesktop.pkg.recipe
      sha256_hash: 8bfa208120d6372efa61b1043046f6a08ef896e0d4c07a0853cd3f532026c798
    com.github.kitzy.fleet.GithubDesktop:
      git_hash: 6a57f150145b09d95e1bc184797b3bb0c9ac6f1d
      path: ~/Library/AutoPkg/RecipeRepos/com.github.kitzy.fleet-autopkg-recipes/GitHub/GithubDesktop.fleet.recipe.yaml
      sha256_hash: 9ae9b3eb9315437b9d9dc28d13865b7e74ffcb439d5ff69de66e94c5f473f2a7
