Description: 'Builds Github Desktop.pkg using the upstream recipe, then uploads to
  Fleet and opens a GitOps PR.

  '
Identifier: com.kitzy.fleet.GithubDesktop
Input:
  NAME: Github Desktop
MinimumVersion: '2.0'
ParentRecipe: com.github.homebysix.pkg.GitHubDesktop
ParentRecipeTrustInfo:
  non_core_processors: {}
  parent_recipes:
    com.github.homebysix.download.GitHubDesktop:
      git_hash: 929f09a8dc248349e9ce35f7d519c253298317d1
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.homebysix-recipes/GitHub/GitHubDesktop.download.recipe
      sha256_hash: ddd466175cff624508787263a470f89b7c2dcc517e1d5cc381f59ec06c846012
    com.github.homebysix.pkg.GitHubDesktop:
      git_hash: dab19d8c72d5b4d2bab35a25dfd43d2e4ab15173
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.homebysix-recipes/GitHub/GitHubDesktop.pkg.recipe
      sha256_hash: 8bfa208120d6372efa61b1043046f6a08ef896e0d4c07a0853cd3f532026c798
Process:
- Arguments:
    automatic_install: false
    branch_prefix: autopkg
    fleet_api_base: https://fleet.kitzy.net
    fleet_api_token: '%FLEET_API_TOKEN%'
    git_author_email: autopkg-bot@kitzy.net
    git_author_name: autopkg-bot
    git_base_branch: main
    git_repo_url: https://github.com/kitzy/fleet-gitops
    github_token: '%FLEET_GITOPS_GITHUB_TOKEN%'
    package_yaml_suffix: .yml
    pkg_path: '%pkg_path%'
    platform: darwin
    pr_labels:
    - autopkg
    self_service: true
    software_dir: lib/macos/software
    software_slug: github-desktop
    software_title: '%NAME%'
    team_id: 4
    team_yaml_package_path_prefix: ../lib/macos/software/
    team_yaml_path: teams/workstations.yml
    version: '%version%'
  Processor: FleetGitOpsUploader
