Identifier: local.fleet.GithubDesktop
Input:
  BUILD: darwin
  BUNDLE_ID: com.github.GitHub
  NAME: Github Desktop
ParentRecipe: com.github.kitzy.fleet.GithubDesktop
ParentRecipeTrustInfo:
  non_core_processors:
    com.github.kitzy.FleetGitOpsUploader/FleetGitOpsUploader:
      git_hash: be76042d6797c8eec9ffb7e7c486711ad6628900
      path: ~/Library/AutoPkg/RecipeRepos/com.github.kitzy.fleet-autopkg-recipes/FleetGitOpsUploader/FleetGitOpsUploader.py
      sha256_hash: 5b0b0c72afe4bcf2cdf0e9c8bbc39cf37af848b2edc501bc34af112810e76745
  parent_recipes:
    com.github.homebysix.download.GitHubDesktop:
      git_hash: 929f09a8dc248349e9ce35f7d519c253298317d1
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.homebysix-recipes/GitHub/GitHubDesktop.download.recipe
      sha256_hash: ddd466175cff624508787263a470f89b7c2dcc517e1d5cc381f59ec06c846012
    com.github.homebysix.pkg.GitHubDesktop:
      git_hash: dab19d8c72d5b4d2bab35a25dfd43d2e4ab15173
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.homebysix-recipes/GitHub/GitHubDesktop.pkg.recipe
      sha256_hash: 8bfa208120d6372efa61b1043046f6a08ef896e0d4c07a0853cd3f532026c798
    com.github.kitzy.fleet.GithubDesktop:
      git_hash: be76042d6797c8eec9ffb7e7c486711ad6628900
      path: ~/Library/AutoPkg/RecipeRepos/com.github.kitzy.fleet-autopkg-recipes/GitHub/GithubDesktop.fleet.recipe.yaml
      sha256_hash: ab7b49c48e3325149609afa8c3a5eb8a26814f639d6fbc3c29545388ead24a5e
