Identifier: local.fleet.GithubDesktop
Input:
  BUILD: darwin
  BUNDLE_ID: com.github.GitHub
  NAME: GitHub Desktop
ParentRecipe: com.github.kitzy.fleet.GithubDesktop
ParentRecipeTrustInfo:
  non_core_processors:
    com.github.kitzy.FleetImporter/FleetImporter:
      git_hash: 898cd44c4df8e8dfe19b2e583ee37b7a0f0a2863
      path: ~/Library/AutoPkg/RecipeRepos/com.github.kitzy.fleet-autopkg-recipes/FleetImporter/FleetImporter.py
      sha256_hash: 65060f0e00729f659d89fd86fefa6c1fd62202d606d404ef2eccab0fbc2ac595
  parent_recipes:
    com.github.homebysix.download.GitHubDesktop:
      git_hash: 929f09a8dc248349e9ce35f7d519c253298317d1
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.homebysix-recipes/GitHub/GitHubDesktop.download.recipe
      sha256_hash: ddd466175cff624508787263a470f89b7c2dcc517e1d5cc381f59ec06c846012
    com.github.homebysix.pkg.GitHubDesktop:
      git_hash: 0d565f5f4889452bbf8b2af22761f4116741d4e2
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.homebysix-recipes/GitHub/GitHubDesktop.pkg.recipe
      sha256_hash: 063d53ac38fbca09b04ee56258b6135578b858213bbb28b298298c1de345136b
    com.github.kitzy.fleet.GithubDesktop:
      git_hash: 898cd44c4df8e8dfe19b2e583ee37b7a0f0a2863
      path: ~/Library/AutoPkg/RecipeRepos/com.github.kitzy.fleet-autopkg-recipes/GitHub/GithubDesktop.fleet.recipe.yaml
      sha256_hash: 71bd1f99cc0c480e85be1102b6b963b0ab6ca69adcc908bff591dfa57bb36406
