Identifier: local.gitops.fleet.GoogleChrome
Input:
  DOWNLOAD_URL: https://dl.google.com/chrome/mac/universal/stable/GGRO/googlechrome.dmg
  FLEET_GITOPS_SOFTWARE_DIR: lib/macos/software
  FLEET_GITOPS_TEAM_YAML_PATH: teams/workstations.yml
  NAME: Google Chrome
ParentRecipe: com.github.kitzy.fleet.gitops.GoogleChrome
ParentRecipeTrustInfo:
  non_core_processors:
    com.github.kitzy.FleetImporter/FleetImporter:
      git_hash: a8e6b0ec85c88f59435d9073f7523afee7814029
      path: ~/Library/AutoPkg/RecipeRepos/com.github.kitzy.fleet-autopkg-recipes/FleetImporter/FleetImporter.py
      sha256_hash: ad9af631e3426ace4fbe4604673b0a49e353011cb5f562588a949199dd1ee9b4
  parent_recipes:
    com.github.autopkg.download.googlechrome:
      git_hash: 6f8bd33df3f7ab53eb679749eae8f04227790652
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.recipes/GoogleChrome/GoogleChrome.download.recipe
      sha256_hash: c1ff98fc5b70f0794bfa43ddb9e9a46c5c045786037790ae422f47e936de3126
    com.github.autopkg.pkg.googlechrome:
      git_hash: dac213359eb245c48828a78d945ba8e1737f6a72
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.recipes/GoogleChrome/GoogleChrome.pkg.recipe
      sha256_hash: 14cc800d4d3179b9a67f8c492dc40acebe4e135ebd556b1ef9580214a43e915c
    com.github.kitzy.fleet.gitops.GoogleChrome:
      git_hash: 9cf6e4eb00a33a1e9b4685484dfc4cb85462c723
      path: ~/Library/AutoPkg/RecipeRepos/com.github.kitzy.fleet-autopkg-recipes/Google/GoogleChrome.fleet.gitops.recipe.yaml
      sha256_hash: b9d60011c75362251e18265b2c804171af88cb1f4db34a8a89bfd122be622ed6
