Identifier: local.fleet.GoogleChrome
Input:
  DOWNLOAD_URL: https://dl.google.com/chrome/mac/universal/stable/GGRO/googlechrome.dmg
  NAME: Google Chrome
ParentRecipe: com.github.kitzy.fleet.GoogleChrome
ParentRecipeTrustInfo:
  non_core_processors:
    FleetGitOpsUploader:
      git_hash: 886a2f2b404c2707009653f7c00ee1e602ae0e79
      path: ~/Library/AutoPkg/RecipeRepos/com.github.kitzy.fleet-autopkg-recipes/FleetGitOpsUploader.py
      sha256_hash: 40fb09f84311c0e19d29aed27f86aacefcc13f377510a491a8db4ab736f438f3
  parent_recipes:
    com.github.autopkg.download.googlechrome:
      git_hash: 6f8bd33df3f7ab53eb679749eae8f04227790652
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.recipes/GoogleChrome/GoogleChrome.download.recipe
      sha256_hash: c1ff98fc5b70f0794bfa43ddb9e9a46c5c045786037790ae422f47e936de3126
    com.github.autopkg.pkg.googlechrome:
      git_hash: f29f399c54adee7122e9fdc3c1ea7ed4c67388a4
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.recipes/GoogleChrome/GoogleChrome.pkg.recipe
      sha256_hash: 5acdf716353ccc57f021008bc5b4b55a5cb4e578e0f96864b71d4d2d29742ec8
    com.github.kitzy.fleet.GoogleChrome:
      git_hash: ab86416072b423f9d9afb4f6bc158cc7944e3e03
      path: ~/Library/AutoPkg/RecipeRepos/com.github.kitzy.fleet-autopkg-recipes/GoogleChrome.fleet.recipe.yaml
      sha256_hash: 03d1508fe03b9da63d1609b3635f837312e6bbc694749563085aaa022e6e7364
