Identifier: local.fleet.GoogleChrome
Input:
  DOWNLOAD_URL: https://dl.google.com/chrome/mac/universal/stable/GGRO/googlechrome.dmg
  NAME: Google Chrome
ParentRecipe: com.github.kitzy.fleet.GoogleChrome
ParentRecipeTrustInfo:
  non_core_processors:
    com.github.kitzy.FleetImporter/FleetImporter:
      git_hash: f2da228b8917097d82e17aa4d52e36c4d51f5035
      path: ~/Library/AutoPkg/RecipeRepos/com.github.kitzy.fleet-autopkg-recipes/FleetImporter/FleetImporter.py
      sha256_hash: f6bc88d927384421cddc3830f9d3ee05212a8ae2a0d318154788b9231a9bf7db
  parent_recipes:
    com.github.autopkg.download.googlechrome:
      git_hash: 6f8bd33df3f7ab53eb679749eae8f04227790652
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.recipes/GoogleChrome/GoogleChrome.download.recipe
      sha256_hash: c1ff98fc5b70f0794bfa43ddb9e9a46c5c045786037790ae422f47e936de3126
    com.github.autopkg.pkg.googlechrome:
      git_hash: dac213359eb245c48828a78d945ba8e1737f6a72
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.recipes/GoogleChrome/GoogleChrome.pkg.recipe
      sha256_hash: 14cc800d4d3179b9a67f8c492dc40acebe4e135ebd556b1ef9580214a43e915c
    com.github.kitzy.fleet.GoogleChrome:
      git_hash: 898cd44c4df8e8dfe19b2e583ee37b7a0f0a2863
      path: ~/Library/AutoPkg/RecipeRepos/com.github.kitzy.fleet-autopkg-recipes/Google/GoogleChrome.fleet.recipe.yaml
      sha256_hash: 6293006134d6b8e022e5ea08272911f3ba64cedec4b0c17f770eb83f972a7b71
