Identifier: local.fleet.GoogleChrome
Input:
  DOWNLOAD_URL: https://dl.google.com/chrome/mac/universal/stable/GGRO/googlechrome.dmg
  NAME: Google Chrome
ParentRecipe: com.github.kitzy.fleet.GoogleChrome
ParentRecipeTrustInfo:
  non_core_processors:
    FleetGitOpsUploader:
      path: ""
      sha256_hash: PROCESSOR FILEPATH NOT FOUND
  parent_recipes:
    com.github.autopkg.download.googlechrome:
      git_hash: 6f8bd33df3f7ab53eb679749eae8f04227790652
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.recipes/GoogleChrome/GoogleChrome.download.recipe
      sha256_hash: c1ff98fc5b70f0794bfa43ddb9e9a46c5c045786037790ae422f47e936de3126
    com.github.autopkg.pkg.googlechrome:
      git_hash: f29f399c54adee7122e9fdc3c1ea7ed4c67388a4
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.recipes/GoogleChrome/GoogleChrome.pkg.recipe
      sha256_hash: 5acdf716353ccc57f021008bc5b4b55a5cb4e578e0f96864b71d4d2d29742ec8
    com.github.kitzy.fleet.GoogleChrome:
      git_hash: 933ab12388d1ec3d88d7b06b8a7a836861d9f294
      path: ~/Library/AutoPkg/RecipeRepos/com.github.kitzy.fleet-autopkg-recipes/Google/GoogleChrome.fleet.recipe.yaml
      sha256_hash: 3ca5a8c0d2572ee286774c35c18eae6a2ec179b9c77596307ca2f5777f4f2053