Description: >
  Builds Google Chrome.pkg using the upstream recipe, then uploads to Fleet
  and opens a GitOps PR.
Identifier: com.kitzy.fleet.GoogleChrome
Input:
  NAME: Google Chrome
MinimumVersion: "2.0"
ParentRecipe: com.github.autopkg.pkg.googlechrome
ParentRecipeTrustInfo:
  non_core_processors: {}
  parent_recipes:
    com.github.autopkg.download.googlechrome:
      git_hash: "6f8bd33df3f7ab53eb679749eae8f04227790652"
      path: "~/Library/AutoPkg/RecipeRepos/com.github.autopkg.recipes/GoogleChrome/GoogleChrome.download.recipe"
      sha256_hash: "c1ff98fc5b70f0794bfa43ddb9e9a46c5c045786037790ae422f47e936de3126"
    com.github.autopkg.pkg.googlechrome:
      git_hash: "f29f399c54adee7122e9fdc3c1ea7ed4c67388a4"
      path: "~/Library/AutoPkg/RecipeRepos/com.github.autopkg.recipes/GoogleChrome/GoogleChrome.pkg.recipe"
      sha256_hash: "5acdf716353ccc57f021008bc5b4b55a5cb4e578e0f96864b71d4d2d29742ec8"
Process:
  - Arguments:
      automatic_install: false
      defaults_path: fleet.defaults.yaml
      fleet_api_token: "%FLEET_API_TOKEN%"
      github_token: "%GITHUB_TOKEN%"
      pkg_path: "%pathname%"
      platform: darwin
      self_service: true
      software_slug: google-chrome
      software_title: "%NAME%"
      version: "%version%"
      fleet_api_base: "https://fleet.kitzy.net"
      team_id: 4
      git_repo_url: "https://github.com/kitzy/fleet-gitops"
      git_base_branch: "main"
      git_author_name: "autopkg-bot"
      git_author_email: "autopkg-bot@kitzy.net"
      team_yaml_path: "teams/workstations.yml"
      software_dir: "lib/macos/software"
      package_yaml_suffix: ".yml"
      team_yaml_package_path_prefix: "../lib/macos/software/"
      pr_labels: ["autopkg"]          # or ["autopkg","software-update"]
      branch_prefix: "autopkg"
    Processor: FleetGitOpsUploader
