<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>local.gitops.fleet.GoogleChrome</string>
	<key>Input</key>
	<dict>
		<key>DOWNLOAD_URL</key>
		<string>https://dl.google.com/chrome/mac/universal/stable/GGRO/googlechrome.dmg</string>
		<key>FLEET_GITOPS_SOFTWARE_DIR</key>
		<string>lib/macos/software</string>
		<key>FLEET_GITOPS_TEAM_YAML_PATH</key>
		<string>teams/workstations.yml</string>
		<key>NAME</key>
		<string>Google Chrome</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.kitzy.fleet.gitops.GoogleChrome</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict>
			<key>com.github.kitzy.FleetImporter/FleetImporter</key>
			<dict>
				<key>git_hash</key>
				<string>a8e6b0ec85c88f59435d9073f7523afee7814029</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.kitzy.fleetimporter/FleetImporter/FleetImporter.py</string>
				<key>sha256_hash</key>
				<string>ad9af631e3426ace4fbe4604673b0a49e353011cb5f562588a949199dd1ee9b4</string>
			</dict>
		</dict>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.autopkg.download.googlechrome</key>
			<dict>
				<key>git_hash</key>
				<string>6f8bd33df3f7ab53eb679749eae8f04227790652</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.recipes/GoogleChrome/GoogleChrome.download.recipe</string>
				<key>sha256_hash</key>
				<string>c1ff98fc5b70f0794bfa43ddb9e9a46c5c045786037790ae422f47e936de3126</string>
			</dict>
			<key>com.github.autopkg.pkg.googlechrome</key>
			<dict>
				<key>git_hash</key>
				<string>f29f399c54adee7122e9fdc3c1ea7ed4c67388a4</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.recipes/GoogleChrome/GoogleChrome.pkg.recipe</string>
				<key>sha256_hash</key>
				<string>5acdf716353ccc57f021008bc5b4b55a5cb4e578e0f96864b71d4d2d29742ec8</string>
			</dict>
			<key>com.github.kitzy.fleet.gitops.GoogleChrome</key>
			<dict>
				<key>git_hash</key>
				<string>9cf6e4eb00a33a1e9b4685484dfc4cb85462c723</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.kitzy.fleetimporter/Google/GoogleChrome.fleet.gitops.recipe.yaml</string>
				<key>sha256_hash</key>
				<string>b9d60011c75362251e18265b2c804171af88cb1f4db34a8a89bfd122be622ed6</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
