<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>local.fleet.GoogleChrome</string>
	<key>Input</key>
	<dict>
		<key>DOWNLOAD_URL</key>
		<string>https://dl.google.com/chrome/mac/universal/stable/GGRO/googlechrome.dmg</string>
		<key>NAME</key>
		<string>Google Chrome</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.kitzy.fleet.GoogleChrome</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict>
			<key>FleetGitOpsUploader</key>
			<dict>
				<key>path</key>
				<string></string>
				<key>sha256_hash</key>
				<string>PROCESSOR FILEPATH NOT FOUND</string>
			</dict>
		</dict>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.autopkg.download.googlechrome</key>
			<dict>
				<key>git_hash</key>
				<string>6f8bd33df3f7ab53eb679749eae8f04227790652</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.recipes/GoogleChrome/GoogleChrome.download.recipe</string>
				<key>sha256_hash</key>
				<string>c1ff98fc5b70f0794bfa43ddb9e9a46c5c045786037790ae422f47e936de3126</string>
			</dict>
			<key>com.github.autopkg.pkg.googlechrome</key>
			<dict>
				<key>git_hash</key>
				<string>f29f399c54adee7122e9fdc3c1ea7ed4c67388a4</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.recipes/GoogleChrome/GoogleChrome.pkg.recipe</string>
				<key>sha256_hash</key>
				<string>5acdf716353ccc57f021008bc5b4b55a5cb4e578e0f96864b71d4d2d29742ec8</string>
			</dict>
			<key>com.github.kitzy.fleet.GoogleChrome</key>
			<dict>
				<key>git_hash</key>
				<string>933ab12388d1ec3d88d7b06b8a7a836861d9f294</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.kitzy.fleet-autopkg-recipes/Google/GoogleChrome.fleet.recipe.yaml</string>
				<key>sha256_hash</key>
				<string>3ca5a8c0d2572ee286774c35c18eae6a2ec179b9c77596307ca2f5777f4f2053</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
