Identifier: local.fleet.GoogleChrome
Input:
  DOWNLOAD_URL: https://dl.google.com/chrome/mac/universal/stable/GGRO/googlechrome.dmg
  NAME: Google Chrome
ParentRecipe: com.github.kitzy.fleet.GoogleChrome
ParentRecipeTrustInfo:
  non_core_processors:
    com.github.kitzy.FleetImporter/FleetImporter:
      git_hash: 6d050b31a1207a7543f9777dd7c1d84c746a011f
      path: ~/Library/AutoPkg/RecipeRepos/com.github.kitzy.fleet-autopkg-recipes/FleetImporter/FleetImporter.py
      sha256_hash: 99d8ee605b4f94ec583054d443c715ad46fc04f998497118e6001cdf391c987f
  parent_recipes:
    com.github.autopkg.download.googlechrome:
      git_hash: 6f8bd33df3f7ab53eb679749eae8f04227790652
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.recipes/GoogleChrome/GoogleChrome.download.recipe
      sha256_hash: c1ff98fc5b70f0794bfa43ddb9e9a46c5c045786037790ae422f47e936de3126
    com.github.autopkg.pkg.googlechrome:
      git_hash: f29f399c54adee7122e9fdc3c1ea7ed4c67388a4
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.recipes/GoogleChrome/GoogleChrome.pkg.recipe
      sha256_hash: 5acdf716353ccc57f021008bc5b4b55a5cb4e578e0f96864b71d4d2d29742ec8
    com.github.kitzy.fleet.GoogleChrome:
      git_hash: 6a57f150145b09d95e1bc184797b3bb0c9ac6f1d
      path: ~/Library/AutoPkg/RecipeRepos/com.github.kitzy.fleet-autopkg-recipes/Google/GoogleChrome.fleet.recipe.yaml
      sha256_hash: 6bdaafd1735f3211030261cb331a08a435fd61e8bde62d7fd7c9f9dc55938e8a
