Identifier: local.fleet.GPGSuite
Input:
  NAME: GPG Suite
  SPARKLE_FEED_URL: https://gpgtools.org/releases/gpgsuite/appcast.xml
ParentRecipe: com.github.kitzy.fleet.GPGSuite
ParentRecipeTrustInfo:
  non_core_processors:
    com.github.kitzy.FleetImporter/FleetImporter:
      git_hash: 898cd44c4df8e8dfe19b2e583ee37b7a0f0a2863
      path: ~/Library/AutoPkg/RecipeRepos/com.github.kitzy.fleet-autopkg-recipes/FleetImporter/FleetImporter.py
      sha256_hash: 65060f0e00729f659d89fd86fefa6c1fd62202d606d404ef2eccab0fbc2ac595
  parent_recipes:
    com.github.gerardkok.download.GPGSuite:
      git_hash: 0f868e1baf5baa2dcd06fcef8a9c2a6fd9bf5119
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.gerardkok-recipes/GPGTools/GPGSuite.download.recipe
      sha256_hash: 627c799094cc97489b3f1fc15bd6f21810efad349f077a8b9e6419b0ce1b0513
    com.github.kitzy.fleet.GPGSuite:
      git_hash: 898cd44c4df8e8dfe19b2e583ee37b7a0f0a2863
      path: ~/Library/AutoPkg/RecipeRepos/com.github.kitzy.fleet-autopkg-recipes/GPGSuite/GPGSuite.fleet.recipe.yaml
      sha256_hash: c96ecf0bbc080fd7fa9c637b4cc4609f8cc77a47e72b32e05e2eb89cdac2a79e
    com.github.kitzy.pkg.GPGSuite:
      git_hash: b16607390b8411ba8589b752962a2d4d716aeab2
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.kitzy-recipes/GPG Suite/GPGSuite.pkg.recipe
      sha256_hash: 91fb797c56c9343e14b8c24d299fff9707eae5da9951df3dfdef64efb935d8af
