Identifier: local.fleet.Signal
Input:
  NAME: Signal
ParentRecipe: com.github.kitzy.fleet.Signal
ParentRecipeTrustInfo:
  non_core_processors:
    com.github.kitzy.FleetImporter/FleetImporter:
      git_hash: 9c5cd2bba4c0d7de4a18290ae079701aada27ef6
      path: ~/Library/AutoPkg/RecipeRepos/com.github.kitzy.fleet-autopkg-recipes/FleetImporter/FleetImporter.py
      sha256_hash: 0988d19688f8c5d1b9f2c8e62aa4d594453f1b172beb76d74f43301014d711cd
  parent_recipes:
    com.github.jaharmi.download.Signal:
      git_hash: 5e999b844a573b676832feb5f4c68516cd88e6e0
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.jaharmi-recipes/Signal/Signal.download.recipe
      sha256_hash: 089df972696bb5138da1531b09584ce84ec4e1bdd6c958a3886aa30b5eb30e0e
    com.github.jaharmi.pkg.Signal:
      git_hash: 5e999b844a573b676832feb5f4c68516cd88e6e0
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.jaharmi-recipes/Signal/Signal.pkg.recipe
      sha256_hash: 3035aba69c89a833ba9efb44dadba68fc04cc55fefca7850d3ac70087157a941
    com.github.kitzy.fleet.Signal:
      git_hash: 898cd44c4df8e8dfe19b2e583ee37b7a0f0a2863
      path: ~/Library/AutoPkg/RecipeRepos/com.github.kitzy.fleet-autopkg-recipes/Signal/Signal.fleet.recipe.yaml
      sha256_hash: 3cd290e718d82f9e0e71f72c3953be3cc7a6d6cae14b4eb121e571962e5baa6f
