Identifier: local.fleet.Signal
Input:
  NAME: Signal
ParentRecipe: com.github.kitzy.fleet.Signal
ParentRecipeTrustInfo:
  non_core_processors:
    com.github.kitzy.FleetImporter/FleetImporter:
      git_hash: f2da228b8917097d82e17aa4d52e36c4d51f5035
      path: ~/Library/AutoPkg/RecipeRepos/com.github.kitzy.fleet-autopkg-recipes/FleetImporter/FleetImporter.py
      sha256_hash: f6bc88d927384421cddc3830f9d3ee05212a8ae2a0d318154788b9231a9bf7db
  parent_recipes:
    com.github.jaharmi.download.Signal:
      git_hash: 5e999b844a573b676832feb5f4c68516cd88e6e0
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.jaharmi-recipes/Signal/Signal.download.recipe
      sha256_hash: 089df972696bb5138da1531b09584ce84ec4e1bdd6c958a3886aa30b5eb30e0e
    com.github.jaharmi.pkg.Signal:
      git_hash: 5e999b844a573b676832feb5f4c68516cd88e6e0
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.jaharmi-recipes/Signal/Signal.pkg.recipe
      sha256_hash: 3035aba69c89a833ba9efb44dadba68fc04cc55fefca7850d3ac70087157a941
    com.github.kitzy.fleet.Signal:
      git_hash: 898cd44c4df8e8dfe19b2e583ee37b7a0f0a2863
      path: ~/Library/AutoPkg/RecipeRepos/com.github.kitzy.fleet-autopkg-recipes/Signal/Signal.fleet.recipe.yaml
      sha256_hash: 3cd290e718d82f9e0e71f72c3953be3cc7a6d6cae14b4eb121e571962e5baa6f
