Identifier: local.fleet.Zoom
Input:
  BUNDLE_ID: us.zoom.xos
  DOWNLOAD_URL: https://zoom.us/client/latest/ZoomInstallerIT.pkg
  NAME: Zoom
  USER_AGENT: Mozilla/5.0 (Macintosh; Intel Mac OS X 10_8_3) AppleWebKit/536.28.10
    (KHTML, like Gecko) Version/6.0.3 Safari/536.28.10
ParentRecipe: com.github.kitzy.fleet.Zoom
ParentRecipeTrustInfo:
  non_core_processors:
    com.github.kitzy.FleetImporter/FleetImporter:
      git_hash: d465960d144a9cec9ddc1b4aecda60dd57317b7f
      path: ~/Library/AutoPkg/RecipeRepos/com.github.kitzy.fleet-autopkg-recipes/FleetImporter/FleetImporter.py
      sha256_hash: a4ef62248670068f8faeb2a22e4ac731eced73699689eda220f05fe752571520
  parent_recipes:
    com.github.hansen-m.download.zoomus:
      git_hash: 19f9cd527d309f57360b9e3f42da508878e27ae5
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.hansen-m-recipes/Zoom/Zoom.download.recipe
      sha256_hash: 3c4a2f325de4d51163c93505dd134918c9b2cae5089f555d59fac62f14bce007
    com.github.homebysix.pkg.Zoom:
      git_hash: 0d565f5f4889452bbf8b2af22761f4116741d4e2
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.homebysix-recipes/Zoom/Zoom.pkg.recipe
      sha256_hash: e58254542c046d96f7d309ecd7760710057c5debd171b394fce75ee0466187b5
    com.github.kitzy.fleet.Zoom:
      git_hash: 898cd44c4df8e8dfe19b2e583ee37b7a0f0a2863
      path: ~/Library/AutoPkg/RecipeRepos/com.github.kitzy.fleet-autopkg-recipes/Zoom/Zoom.fleet.recipe.yaml
      sha256_hash: 1390ea8106cfb28e5c9c465af4e57d9c5b046edad703d1ddc3435aec64bd0ffa
