Identifier: local.fleet.Zoom
Input:
  BUNDLE_ID: us.zoom.xos
  DOWNLOAD_URL: https://zoom.us/client/latest/ZoomInstallerIT.pkg
  NAME: Zoom
  USER_AGENT: Mozilla/5.0 (Macintosh; Intel Mac OS X 10_8_3) AppleWebKit/536.28.10
    (KHTML, like Gecko) Version/6.0.3 Safari/536.28.10
ParentRecipe: com.github.kitzy.fleet.Zoom
ParentRecipeTrustInfo:
  non_core_processors:
    com.github.kitzy.FleetImporter/FleetImporter:
      git_hash: 898cd44c4df8e8dfe19b2e583ee37b7a0f0a2863
      path: ~/Library/AutoPkg/RecipeRepos/com.github.kitzy.fleet-autopkg-recipes/FleetImporter/FleetImporter.py
      sha256_hash: 65060f0e00729f659d89fd86fefa6c1fd62202d606d404ef2eccab0fbc2ac595
  parent_recipes:
    com.github.hansen-m.download.zoomus:
      git_hash: 19f9cd527d309f57360b9e3f42da508878e27ae5
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.hansen-m-recipes/Zoom/Zoom.download.recipe
      sha256_hash: 3c4a2f325de4d51163c93505dd134918c9b2cae5089f555d59fac62f14bce007
    com.github.homebysix.pkg.Zoom:
      git_hash: 3fc6a51644cfa9b791d2ff3ab6434390b073131c
      path: ~/Library/AutoPkg/RecipeRepos/com.github.autopkg.homebysix-recipes/Zoom/Zoom.pkg.recipe
      sha256_hash: 016702213ba03e795107961d41e13173c2d5a95476c74ba9f2b596c1c441c9ff
    com.github.kitzy.fleet.Zoom:
      git_hash: 898cd44c4df8e8dfe19b2e583ee37b7a0f0a2863
      path: ~/Library/AutoPkg/RecipeRepos/com.github.kitzy.fleet-autopkg-recipes/Zoom/Zoom.fleet.recipe.yaml
      sha256_hash: 1390ea8106cfb28e5c9c465af4e57d9c5b046edad703d1ddc3435aec64bd0ffa
