<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Builds Google Chrome.pkg using the upstream recipe, then uploads to Fleet and opens a GitOps PR.</string>
	<key>Identifier</key>
	<string>com.kitzy.fleet.GoogleChrome</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Google Chrome</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.pkg.googlechrome</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict/>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.autopkg.download.googlechrome</key>
			<dict>
				<key>git_hash</key>
				<string>6f8bd33df3f7ab53eb679749eae8f04227790652</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.recipes/GoogleChrome/GoogleChrome.download.recipe</string>
				<key>sha256_hash</key>
				<string>c1ff98fc5b70f0794bfa43ddb9e9a46c5c045786037790ae422f47e936de3126</string>
			</dict>
			<key>com.github.autopkg.pkg.googlechrome</key>
			<dict>
				<key>git_hash</key>
				<string>f29f399c54adee7122e9fdc3c1ea7ed4c67388a4</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.recipes/GoogleChrome/GoogleChrome.pkg.recipe</string>
				<key>sha256_hash</key>
				<string>5acdf716353ccc57f021008bc5b4b55a5cb4e578e0f96864b71d4d2d29742ec8</string>
			</dict>
		</dict>
	</dict>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>automatic_install</key>
				<false/>
				<key>defaults_path</key>
				<string>config/fleet.defaults.yaml</string>
				<key>fleet_api_token</key>
				<string>%FLEET_API_TOKEN%</string>
				<key>github_token</key>
				<string>%GITHUB_TOKEN%</string>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>platform</key>
				<string>darwin</string>
				<key>self_service</key>
				<true/>
				<key>software_slug</key>
				<string>google-chrome</string>
				<key>software_title</key>
				<string>%NAME%</string>
				<key>version</key>
				<string>%version%</string>
			</dict>
			<key>Processor</key>
			<string>local.processors/FleetGitOpsUploader</string>
		</dict>
	</array>
</dict>
</plist>
